openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564_usb.h
/*******************************************************************************/
/* USBHS Related Register Macro Definition */

/* USBHS Device Register Definition */
/* Bit definition for USB_CTRL register */
#define DEV_LPM_EN                               0x80                                       /* LPM enable */
#define DEV_EN                                   0x20                                       /* USB device enabled */
#define DEV_DMA_EN                               0x10                                       /* DMA transfer enabled */
#define PHY_SUSPENDM                             0x08                                       /* USB PHY suspend */
#define USB_ALL_CLR                              0x04                                       /* clear all interrupt flags */
#define SIE_RESET                                0x02                                       /* USB protocol processor reset */
#define LINK_RESET                               0x01

/* Bit definition for usb_BASE_MODE register */
#define EXP_SPD_MASK                             0x03                                       /* bit[0:1] controls the desired device speed */
#define EXP_FS_SPD                               0x00                                       /* Full-speed mode */
#define EXP_HS_SPD                               0x01                                       /* High-speed mode */
#define EXP_LOW_SPD                              0x02                                       /* Low-speed mode */

/* Bit definition for USB_INT_EN register */
#define FIFO_OVER_IE                             0x80                                       /* USB Overflow interrupt enable */
#define LINK_RDY_IE                              0x40                                       /* USB connection interrupt enable */
#define RX_SOF_IE                                0x20                                       /* Receive SOF packet interrupt enable */
#define RTX_ACT_IE                               0x10                                       /* USB transfer end interrupt enabled */
#define LPM_ACT_IE                               0x08                                       /* LMP transfer end interrupt enabled */
#define BUS_SLEEP_IE                             0x04                                       /* USB bus sleep interrupt enabled */
#define BUS_SUSP_IE                              0x02                                       /* USB bus pause interrupt enabled */
#define BUS_REST_IE                              0x01                                       /* USB bus reset interrupt enabled */

/* Bit definition for USB_DEV_AD register */
#define MASK_USB_ADDR                            0x7f

/* Bit definition for USB_WAKE_CR register */
#define RB_RMT_WAKE                              0x01                                       /* remote wake up */

/* Bit definition for USB_TEST_MODE register */
#define RB_TEST_EN                               0x80                                       /* test mode enable */
#define RB_TEST_SE0NAK                           0x08                                       /* test mode,output SEO */
#define RB_TEST_PKT                              0x04                                       /* test mode,output a packet */
#define RB_TEST_K                                0x02                                       /* test mode,output K */
#define RB_TEST_J                                0x01                                       /* test mode,output J */

/* Bit definition for USB_LPM_DATA register */
#define LPM_BUSY                                 0x8000
#define LPM_DATA                                 0x07ff                                     /* read-only power management data */

/* Bit definition for USB_INT_FG register */
#define FIFO_OVER_IF                             0x80                                       /* read-write USB Overflow interrupt flag */
#define LINK_RDY_IF                              0x40                                       /* read-write USB connection interrupt flag */
#define RX_SOF_IF                                0x20                                       /* read-write Receive SOF packet interrupt flag */
#define RTX_ACT_IF                               0x10                                       /* read-only USB transmission end interrupt flag */
#define LPM_ACT_IF                               0x08                                       /* read-write LPM transmission end interrupt flag */
#define BUS_SLEEP_IF                             0x04                                       /* read-write USB bus sleep interrupt flag */
#define BUS_SUSP_IF                              0x02                                       /* read-write USB bus suspend interrupt flag */
#define BUS_REST_IF                              0x01                                       /* read-write USB bus reset interrupt flag */

/* Bit definition for USB_INT_ST register */
#define RB_UIS_EP_DIR                            0x10                                       /* Endpoint data transmission direction */
#define RB_UIS_EP_ID_MASK                        0x07                                       /* The endpoint number at which the data transfer occurs */

/* Bit definition for USB_MIS_ST register */
#define RB_UMS_HS_MOD                            0x80                                       /* whether the host is high-speed */
#define RB_UMS_SUSP_REQ                          0x10                                       /* USB suspends the request */
#define RB_UMS_FREE                              0x08                                       /* USB free status */
#define RB_UMS_SLEEP                             0x04                                       /* USB sleep status */
#define RB_UMS_SUSPEND                           0x02                                       /* USB suspend status */
#define RB_UMS_READY                             0x01                                       /* USB connection status */

