openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564_usb.h
/* Bit definition for USB_FRAMME_NO register */
#define MICRO_FRAME                              0xe000                                     /* Received micro frame number */
#define FRAME_NO                                 0x07ff                                     /* Received frame number */

/* Bit definition for USB_BUS register */
#define USB_DM_ST                                0x0008                                     /* read-only UDM status */
#define USB_DP_ST                                0x0004                                     /* read-only UDP status */
#define USB_WAKEUP                               0x0001                                     /* read-only USB wakeup */

/* Bit definition for DEV_UEP_TX_EN & DEV_UEP_RX_EN register */
#define RB_EP0_EN                                0x0001
#define RB_EP1_EN                                0x0002
#define RB_EP2_EN                                0x0004
#define RB_EP3_EN                                0x0008
#define RB_EP4_EN                                0x0010
#define RB_EP5_EN                                0x0020
#define RB_EP6_EN                                0x0040
#define RB_EP7_EN                                0x0080
#define RB_EP8_EN                                0x0100
#define RB_EP9_EN                                0x0200
#define RB_EP10_EN                               0x0400
#define RB_EP11_EN                               0x0800
#define RB_EP12_EN                               0x1000
#define RB_EP13_EN                               0x2000
#define RB_EP14_EN                               0x4000
#define RB_EP15_EN                               0x8000

/* Bit definition for DEV_UEP_T_TOG_AUTO register */
#define EP0_T_TOG_AUTO                           0x01
#define EP1_T_TOG_AUTO                           0x02
#define EP2_T_TOG_AUTO                           0x04
#define EP3_T_TOG_AUTO                           0x08
#define EP4_T_TOG_AUTO                           0x10
#define EP5_T_TOG_AUTO                           0x20
#define EP6_T_TOG_AUTO                           0x40
#define EP7_T_TOG_AUTO                           0x80

/* Bit definition for DEV_UEP_R_TOG_AUTO register */
#define EP0_R_TOG_AUTO                           0x01
#define EP1_R_TOG_AUTO                           0x02
#define EP2_R_TOG_AUTO                           0x04
#define EP3_R_TOG_AUTO                           0x08
#define EP4_R_TOG_AUTO                           0x10
#define EP5_R_TOG_AUTO                           0x20
#define EP6_R_TOG_AUTO                           0x40
#define EP7_R_TOG_AUTO                           0x80

/* Bit definition for DEV_UEP_T_BURST register */
#define EP0_T_BURST_EN                           0x01
#define EP1_T_BURST_EN                           0x02
#define EP2_T_BURST_EN                           0x04
#define EP3_T_BURST_EN                           0x08
#define EP4_T_BURST_EN                           0x10
#define EP5_T_BURST_EN                           0x20
#define EP6_T_BURST_EN                           0x40
#define EP7_T_BURST_EN                           0x80

/* Bit definition for DEV_UEP_T_BURST_MODE register */
#define EP0_T_BURST_MODE                         0x01
#define EP1_T_BURST_MODE                         0x02
#define EP2_T_BURST_MODE                         0x04
#define EP3_T_BURST_MODE                         0x08
#define EP4_T_BURST_MODE                         0x10
#define EP5_T_BURST_MODE                         0x20
#define EP6_T_BURST_MODE                         0x40
#define EP7_T_BURST_MODE                         0x80

/* Bit definition for DEV_UEP_R_BURST register */
#define EP0_R_BURST_EN                           0x01
#define EP1_R_BURST_EN                           0x02
#define EP2_R_BURST_EN                           0x04
#define EP3_R_BURST_EN                           0x08
#define EP4_R_BURST_EN                           0x10
#define EP5_R_BURST_EN                           0x20
#define EP6_R_BURST_EN                           0x40
#define EP7_R_BURST_EN                           0x80

/* Bit definition for DEV_UEP_R_RES_MODE register */
#define EP0_R_RES_MODE                           0x01
#define EP1_R_RES_MODE                           0x02
#define EP2_R_RES_MODE                           0x04
#define EP3_R_RES_MODE                           0x08
#define EP4_R_RES_MODE                           0x10
#define EP5_R_RES_MODE                           0x20
#define EP6_R_RES_MODE                           0x40
#define EP7_R_RES_MODE                           0x80

/* Bit definition for DEV_UEP_AF_MODE register */
#define EP1_T_AF                                 0x02
#define EP2_T_AF                                 0x04
#define EP3_T_AF                                 0x08
#define EP4_T_AF                                 0x10
#define EP5_T_AF                                 0x20
#define EP6_T_AF                                 0x40
#define EP7_T_AF                                 0x80

/* Bit definition for UEPx_TX_CTRL register */
#define USBHS_UEP_T_RES_MASK                     0x03                                       /* Response control mask for endpoint 0 transmission */
#define USBHS_UEP_T_RES_NAK                      0x00                                       /* UEP0_TX_CTRL[0:1] = 00, reply NAK to host */
#define USBHS_UEP_T_RES_STALL                    0x01                                       /* UEP0_TX_CTRL[0:1] = 01, reply STALL to host */
#define USBHS_UEP_T_RES_ACK                      0x02                                       /* UEP0_TX_CTRL[0:1] = 10, reply ACK to host */
#define USBHS_UEP_T_RES_NYET                     0x03                                       /* UEP0_TX_CTRL[0:1] = 11, reply NYET to host */
#define USBHS_UEP_T_TOG_MASK                     0x0C                                       /* Synchronization trigger bit mask */
#define USBHS_UEP_T_TOG_DATA0                    0x00                                       /* UEP0_TX_CTRL[2:3] = 00, represents DATA0 */
#define USBHS_UEP_T_TOG_DATA1                    0x04                                       /* UEP0_TX_CTRL[2:3] = 01, represents DATA1 */
#define USBHS_UEP_T_TOG_DATA2                    0x08                                       /* UEP0_TX_CTRL[2:3] = 10, represents DATA2 */
#define USBHS_UEP_T_TOG_MDATA                    0x0C                                       /* UEP0_TX_CTRL[2:3] = 11, represents MDATA */
#define USBHS_UEP_ENDP_T_DONE                    0x80                                       /* Writing 0 clears the interrupt */

/* Bit definition for UEPx_RX_CTRL register */
#define USBHS_UEP_R_RES_MASK                     0x03                                       /* Response control mask for endpoint 0 transmission */
#define USBHS_UEP_R_RES_NAK                      0x00                                       /* UEP0_TX_CTRL[0:1] = 00, reply NAK to host */
#define USBHS_UEP_R_RES_STALL                    0x01                                       /* UEP0_TX_CTRL[0:1] = 01, reply STALL to host */
#define USBHS_UEP_R_RES_ACK                      0x02                                       /* UEP0_TX_CTRL[0:1] = 10, reply ACK to host */
#define USBHS_UEP_R_RES_NYET                     0x03                                       /* UEP0_TX_CTRL[0:1] = 11, reply NYET to host */
#define USBHS_UEP_R_TOG_MASK                     0x0C                                       /* Synchronization trigger bit mask */
#define USBHS_UEP_R_TOG_DATA0                    0x00                                       /* UEP0_TX_CTRL[2:3] = 00, represents DATA0 */
#define USBHS_UEP_R_TOG_DATA1                    0x04                                       /* UEP0_TX_CTRL[2:3] = 01, represents DATA1 */
#define USBHS_UEP_R_TOG_DATA2                    0x08                                       /* UEP0_TX_CTRL[2:3] = 10, represents DATA2 */
#define USBHS_UEP_R_TOG_MDATA                    0x0C                                       /* UEP0_TX_CTRL[2:3] = 11, represents MDATA */
#define USBHS_UEP_ENDP_T_DONE                    0x80                                       /* Writing 0 clears the interrupt */
#define USBHS_UEP_ENDP_R_DONE                    0x80                                       /* Writing 0 clears the interrupt */
#define USBHS_RB_SETUP_IS                        0x08                                       /* Indicates whether the reception of endpoint 0 is a Setup transaction */
#define USBHS_ENDP_R_TOG_MATCH                   0x10

/* Bit definition for DEV_UEP_T_ISO register */
#define EP1_T_ISO                                0x02
#define EP2_T_ISO                                0x04
#define EP3_T_ISO                                0x08
#define EP4_T_ISO                                0x10
#define EP5_T_ISO                                0x20
#define EP6_T_ISO                                0x40
#define EP7_T_ISO                                0x80

/* Bit definition for DEV_UEP_R_ISO register */
#define EP1_R_ISO                                0x02
#define EP2_R_ISO                                0x04
#define EP3_R_ISO                                0x08
#define EP4_R_ISO                                0x10
#define EP5_R_ISO                                0x20
#define EP6_R_ISO                                0x40
#define EP7_R_ISO                                0x80

