openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564_usb.h
/* USBHS Host Register Definition */
/* Bit definition for UHOST_CTRL register */
#define root_LPM_EN         (1<<7)
#define ROOT_FORCE_FS       (1<<6)
#define ROOT_SOF_EN         (1<<5)
#define ROOT_DMA_EN         (1<<4)
#define ROOT_PHY_SUSPENDM   (1<<3)
#define ROOT_ALL_CLR        (1<<2)
#define ROOT_SIE_RESET      (1<<1)
#define ROOT_LINK_RESET     (1<<0)

/* Bit definition for UH_INT_EN register */
#define FIFO_OV_IE          (1<<7)
#define TX_HALT_IE          (1<<6)
#define SOF_ACT_IE          (1<<5)
#define USB_ACT_IE          (1<<4)
#define RESUME_ACT_IE       (1<<3)
#define WKUP_ACT_IE         (1<<2)

/* Bit definition for UH_CONTROL register */
#define RX_NO_RES           (1<<23)
#define TX_NO_RES           (1<<22)
#define RX_NO_DATA          (1<<21)
#define TX_NO_DATA          (1<<20)
#define TX_LOW_SPD          (1<<19)
#define SPLIT_VALID         (1<<18)
#define LPM_VALID           (1<<17)
#define HOST_ACTION         (1<<16)
#define BUF_MODE            (1<<10)
#define TOG_MASK            (3<<8)
#define TOG_MDATA           (3<<8)
#define TOG_DATA2           (2<<8)
#define TOG_DATA1           (1<<8)
#define TOG_DATA0           (0<<8)

/* Bit definition for UH_INT_FLAG register */
#define RB_FIFO_OV_IF       (1<<7)
#define RB_TX_HALT_IF       (1<<6)
#define RB_SOF_ACT_IF       (1<<5)
#define RB_USB_ACT_IF       (1<<4)
#define RB_RESUME_ACT_IF    (1<<3)
#define RB_WKUP_IF          (1<<2)

/* Bit definition for UH_INT_ST register */
#define PORT_RX_RESUME      (1<<4)
#define USB_PID_MASK        0x0f
#define USB_PID_TOUT        0x0
#define USB_PID_ACK         0x2
#define USB_PID_NAK         0xa
#define USB_PID_STALL       0xe
#define USB_PID_NYET        0x6
#define USB_PID_DATA0       0x3
#define USB_PID_DATA1       0xb
#define USB_PID_DATA2       0x7
#define USB_PID_MDATA       0xf

#define USB_PID_PRE         0xc
#define USB_PID_ERR         0xc
#define USB_PID_SPLIT       0x8
#define USB_PID_PING        0x4
#define USB_PID_SOF         0x5
#define USB_PID_SETUP       0xd
#define USB_PID_IN          0x9
#define USB_PID_OUT         0x1

/* Bit definition for UH_MIS_ST register */
#define RB_BUS_SE0          (1<<7)
#define RB_BUS_J            (1<<6)
#define RB_LINESTATE_MASK   (0x3<<4)
#define RB_USB_WAKEUP       (1<<3)
#define RB_SOF_ST           (1<<2)
#define RB_SOF_PRE          (1<<1)
#define RB_SOF_FREE         (1<<0)

/* Bit definition for UH_FRAME register */
#define SOF_CNT_CLR         (1<<25)
#define SOF_CNT_EN          (1<<24)

/* Bit definition for PORT_CTRL register */
#define BUS_RST_LONG        (1<<16)
#define PORT_SLEEP_BESL     (0xf<<12)
#define CLR_PORT_SLEEP      (1<<8)
#define CLR_PORT_CONNECT    (1<<5)
#define CLR_PORT_EN         (1<<4)
#define SET_PORT_SLEEP      (1<<3)
#define CLR_PORT_SUSP       (1<<2)
#define SET_PORT_SUSP       (1<<1)
#define SET_PORT_RESET      (1<<0)

/* Bit definition for PORT_CFG register */
#define PORT_15K_RPD        (1<<7)
#define PORT_HOST_MODE      (1<<0)//1: HOST function
#define PORT_DEVICE_MODE    (0<<0)//0: DEVICE function

/* Bit definition for PORT_INT_EN register */
#define PORT_SLP_IE         (1<<5)
#define PORT_RESET_IE       (1<<4)
#define PORT_SUSP_IE        (1<<2)
#define PORT_EN_IE          (1<<1)
#define PORT_CONNECT_IE     (1<<0)

/* Bit definition for PORT_TEST_CT register */
#define TEST_FORCE_EN       (1<<2)
#define TEST_K              (1<<1)
#define TEST_J              (1<<0)

/* Bit definition for PORT_STATUS register */
#define PORT_TEST           (1<<11)
#define PORT_SPD_MASK       (3<<9)
#define PORT_HIGH_SPD       (1<<10)
#define PORT_LOW_SPD        (1<<9)
#define PORT_FULL_SPD       (0<<9)
#define PORT_SLP            (1<<5)
#define PORT_RESETTING      (1<<4)
#define PORT_OVC            (1<<3)
#define PORT_SUSP           (1<<2)
#define PORT_EN             (1<<1)
#define PORT_CONNECT        (1<<0)

/* Bit definition for PORT_STATUS_CHG register */
#define PORT_SLP_IF         (1<<5)
#define PORT_RESET_IF       (1<<4)
#define PORT_SUSP_IF        (1<<2)
#define PORT_EN_IF          (1<<1)
#define PORT_CONNECT_IF     (1<<0)

/* Bit definition for ROOT_BC_CR register */
#define UDM_VSRC_ACT        (1<<10)
#define UDM_BC_CMPE         (1<<9)
#define UDP_BC_CMPE         (1<<8)
#define BC_AUTO_MODE        (1<<6)
#define UDM_BC_VSRC         (1<<5)
#define UDP_BC_VSRC         (1<<4)
#define UDM_BC_CMPO         (1<<1)
#define UDP_BC_CMPO         (1<<0)

/* Bit definition for HSI_CAL_CR register */
#define CLK_SEL             (1<<21)
#define SOF_FREE            (1<<3)
#define SFT_RST             (1<<2)
#define CAL_EN              (1<<1)
#define CAL_RST             (1<<0)

/*******************************************************************************/
/* Struct Definition */

/* USB Setup Request */
typedef struct __attribute__((packed)) _USB_SETUP_REQ
{
    uint8_t  bRequestType;
    uint8_t  bRequest;
    uint16_t wValue;
    uint16_t wIndex;
    uint16_t wLength;
} USB_SETUP_REQ, *PUSB_SETUP_REQ;

/* USB Device Descriptor */
typedef struct __attribute__((packed)) _USB_DEVICE_DESCR
{
    uint8_t  bLength;
    uint8_t  bDescriptorType;
    uint16_t bcdUSB;
    uint8_t  bDeviceClass;
    uint8_t  bDeviceSubClass;
    uint8_t  bDeviceProtocol;
    uint8_t  bMaxPacketSize0;
    uint16_t idVendor;
    uint16_t idProduct;
    uint16_t bcdDevice;
    uint8_t  iManufacturer;
    uint8_t  iProduct;
    uint8_t  iSerialNumber;
    uint8_t  bNumConfigurations;
} USB_DEV_DESCR, *PUSB_DEV_DESCR;

/* USB Configuration Descriptor */
typedef struct __attribute__((packed)) _USB_CONFIG_DESCR
{
    uint8_t  bLength;
    uint8_t  bDescriptorType;
    uint16_t wTotalLength;
    uint8_t  bNumInterfaces;
    uint8_t  bConfigurationValue;
    uint8_t  iConfiguration;
    uint8_t  bmAttributes;
    uint8_t  MaxPower;
} USB_CFG_DESCR, *PUSB_CFG_DESCR;

/* USB Interface Descriptor */
typedef struct __attribute__((packed)) _USB_INTERF_DESCR
{
    uint8_t  bLength;
    uint8_t  bDescriptorType;
    uint8_t  bInterfaceNumber;
    uint8_t  bAlternateSetting;
    uint8_t  bNumEndpoints;
    uint8_t  bInterfaceClass;
    uint8_t  bInterfaceSubClass;
    uint8_t  bInterfaceProtocol;
    uint8_t  iInterface;
} USB_ITF_DESCR, *PUSB_ITF_DESCR;

/* USB Endpoint Descriptor */
typedef struct __attribute__((packed)) _USB_ENDPOINT_DESCR
{
    uint8_t  bLength;
    uint8_t  bDescriptorType;
    uint8_t  bEndpointAddress;
    uint8_t  bmAttributes;
    uint8_t  wMaxPacketSizeL;
    uint8_t  wMaxPacketSizeH;
    uint8_t  bInterval;
} USB_ENDP_DESCR, *PUSB_ENDP_DESCR;

/* USB Configuration Descriptor Set */
typedef struct __attribute__((packed)) _USB_CONFIG_DESCR_LONG
{
    USB_CFG_DESCR  cfg_descr;
    USB_ITF_DESCR  itf_descr;
    USB_ENDP_DESCR endp_descr[ 1 ];
} USB_CFG_DESCR_LONG, *PUSB_CFG_DESCR_LONG;

/* USB HUB Descriptor */
typedef struct __attribute__((packed)) _USB_HUB_DESCR
{
    uint8_t  bDescLength;
    uint8_t  bDescriptorType;
    uint8_t  bNbrPorts;
    uint8_t  wHubCharacteristicsL;
    uint8_t  wHubCharacteristicsH;
    uint8_t  bPwrOn2PwrGood;
    uint8_t  bHubContrCurrent;
    uint8_t  DeviceRemovable;
    uint8_t  PortPwrCtrlMask;
} USB_HUB_DESCR, *PUSB_HUB_DESCR;

/* USB HID Descriptor */
typedef struct __attribute__((packed)) _USB_HID_DESCR
{
    uint8_t  bLength;
    uint8_t  bDescriptorType;
    uint16_t bcdHID;
    uint8_t  bCountryCode;
    uint8_t  bNumDescriptors;
    uint8_t  bDescriptorTypeX;
    uint8_t  wDescriptorLengthL;
    uint8_t  wDescriptorLengthH;
} USB_HID_DESCR, *PUSB_HID_DESCR;

/* USB UDisk */
typedef struct __attribute__((packed)) _UDISK_BOC_CBW
{
    uint32_t mCBW_Sig;
    uint32_t mCBW_Tag;
    uint32_t mCBW_DataLen;
    uint8_t  mCBW_Flag;
    uint8_t  mCBW_LUN;
    uint8_t  mCBW_CB_Len;
    uint8_t  mCBW_CB_Buf[ 16 ];
} UDISK_BOC_CBW, *PXUDISK_BOC_CBW;

/* USB UDisk */
typedef struct __attribute__((packed)) _UDISK_BOC_CSW
{
    uint32_t mCBW_Sig;
    uint32_t mCBW_Tag;
    uint32_t mCSW_Residue;
    uint8_t  mCSW_Status;
} UDISK_BOC_CSW, *PXUDISK_BOC_CSW;

#ifdef __cplusplus
}
#endif

#endif
